using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Romanizer
{
    internal class ToKatakana : IStringTransformer
    {
        public string Transform(string input)
        {
            var newstr = KatakanaDictionary.Aggregate(input, (current, value) =>
                 current.Replace(value.Key, value.Value));
            return newstr;
        }

        private static readonly Dictionary<string, string> KatakanaDictionary = new()
        {
            #region ひらがな

            { "あ", "ア" },
            { "い", "イ" },
            { "う", "ウ" },
            { "え", "エ" },
            { "お", "オ" },
            { "か", "カ" },
            { "き", "キ" },
            { "く", "ク" },
            { "け", "ケ" },
            { "こ", "コ" },
            { "さ", "サ" },
            { "し", "シ" },
            { "す", "ス" },
            { "せ", "セ" },
            { "そ", "ソ" },
            { "た", "タ" },
            { "ち", "チ" },
            { "つ", "ツ" },
            { "て", "テ" },
            { "と", "ト" },
            { "な", "ナ" },
            { "に", "ニ" },
            { "ぬ", "ヌ" },
            { "ね", "ネ" },
            { "の", "ノ" },
            { "は", "ハ" },
            { "ひ", "ヒ" },
            { "ふ", "フ" },
            { "へ", "ヘ" },
            { "ほ", "ホ" },
            { "ま", "マ" },
            { "み", "ミ" },
            { "む", "ム" },
            { "め", "メ" },
            { "も", "モ" },
            { "や", "ヤ" },
            { "ゆ", "ユ" },
            { "よ", "ヨ" },
            { "ら", "ラ" },
            { "り", "リ" },
            { "る", "ル" },
            { "れ", "レ" },
            { "ろ", "ロ" },
            { "わ", "ワ" },
            { "ゐ", "ヰ" },
            { "ゑ", "ヱ" },
            { "を", "ヲ" },
            { "ん", "ン" },

            { "が", "ガ" },
            { "ぎ", "ギ" },
            { "ぐ", "グ" },
            { "げ", "ゲ" },
            { "ご", "ゴ" },
            { "ざ", "ザ" },
            { "じ", "ジ" },
            { "ず", "ズ" },
            { "ぜ", "ゼ" },
            { "ぞ", "ゾ" },
            { "だ", "ダ" },
            { "ぢ", "ヂ" },
            { "づ", "ヅ" },
            { "で", "デ" },
            { "ど", "ド" },
            { "ば", "バ" },
            { "び", "ビ" },
            { "ぶ", "ブ" },
            { "べ", "ベ" },
            { "ぼ", "ボ" },
            { "ぱ", "パ" },
            { "ぴ", "ピ" },
            { "ぷ", "プ" },
            { "ぺ", "ペ" },
            { "ぽ", "ポ" },
            { "ゔ", "ヴ" },

            { "ぁ", "ァ" },
            { "ぃ", "ィ" },
            { "ぅ", "ゥ" },
            { "ぇ", "ェ" },
            { "ぉ", "ォ" },
            { "ゃ", "ャ" },
            { "ゅ", "ュ" },
            { "ょ", "ョ" },
            
        	#endregion ひらがな

            #region 半カナ

            { "ｱ", "ア" },
            { "ｲ", "イ" },
            { "ｳ", "ウ" },
            { "ｴ", "エ" },
            { "ｵ", "オ" },
            { "ｶ", "カ" },
            { "ｷ", "キ" },
            { "ｸ", "ク" },
            { "ｹ", "ケ" },
            { "ｺ", "コ" },
            { "ｻ", "サ" },
            { "ｼ", "シ" },
            { "ｽ", "ス" },
            { "ｾ", "セ" },
            { "ｿ", "ソ" },
            { "ﾀ", "タ" },
            { "ﾁ", "チ" },
            { "ﾂ", "ツ" },
            { "ﾃ", "テ" },
            { "ﾄ", "ト" },
            { "ﾅ", "ナ" },
            { "ﾆ", "ニ" },
            { "ﾇ", "ヌ" },
            { "ﾈ", "ネ" },
            { "ﾉ", "ノ" },
            { "ﾊ", "ハ" },
            { "ﾋ", "ヒ" },
            { "ﾌ", "フ" },
            { "ﾍ", "ヘ" },
            { "ﾎ", "ホ" },
            { "ﾏ", "マ" },
            { "ﾐ", "ミ" },
            { "ﾑ", "ム" },
            { "ﾒ", "メ" },
            { "ﾓ", "モ" },
            { "ﾔ", "ヤ" },
            { "ﾕ", "ユ" },
            { "ﾖ", "ヨ" },
            { "ﾗ", "ラ" },
            { "ﾘ", "リ" },
            { "ﾙ", "ル" },
            { "ﾚ", "レ" },
            { "ﾛ", "ロ" },
            { "ﾜ", "ワ" },
            { "ｲ", "ヰ" },
            { "ｴ", "ヱ" },
            { "ｦ", "ヲ" },
            { "ﾝ", "ン" },

            { "ｶﾞ", "ガ" },
            { "ｷﾞ", "ギ" },
            { "ｸﾞ", "グ" },
            { "ｹﾞ", "ゲ" },
            { "ｺﾞ", "ゴ" },
            { "ｻﾞ", "ザ" },
            { "ｼﾞ", "ジ" },
            { "ｽﾞ", "ズ" },
            { "ｾﾞ", "ゼ" },
            { "ｿﾞ", "ゾ" },
            { "ﾀﾞ", "ダ" },
            { "ﾁﾞ", "ヂ" },
            { "ﾂﾞ", "ヅ" },
            { "ﾃﾞ", "デ" },
            { "ﾄﾞ", "ド" },
            { "ﾊﾞ", "バ" },
            { "ﾋﾞ", "ビ" },
            { "ﾌﾞ", "ブ" },
            { "ﾍﾞ", "ベ" },
            { "ﾎﾞ", "ボ" },
            { "ﾊﾟ", "パ" },
            { "ﾋﾟ", "ピ" },
            { "ﾌﾟ", "プ" },
            { "ﾍﾟ", "ペ" },
            { "ﾎﾟ", "ポ" },
            { "ｳﾞ", "ヴ" },

            { "ｧ", "ァ" },
            { "ｨ", "ィ" },
            { "ｩ", "ゥ" },
            { "ｪ", "ェ" },
            { "ｫ", "ォ" },
            { "ｬ", "ャ" },
            { "ｭ", "ュ" },
            { "ｮ", "ョ" },

            #endregion 半カナ

            #region ローマ字

            // TODO: ローマ字

	        #endregion ローマ字
        };
    }
}
